fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияработПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий  

Процедура ОбработкаПроведения(Отказ, Режим)
	
	АбонентскийДоговор = (Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	ДействующийДоговор = (Дата >= Договор.ВКМ_НачалоПериодаДействия И Дата <= Договор.ВКМ_ОкончаниеПериодаДействия);
	
	Если АбонентскийДоговор И ДействующийДоговор Тогда
		
		// регистр ВКМ_ВыполненныеКлиентуРаботы Приход
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
		Движение.СуммаКОплате = Движение.КоличествоЧасов * Договор.ВКМ_СтоимостьЧаса;
		
		// регистр ВКМ_ВыполненныеСотрудникомРаботы Приход
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
		
		ПроцентПремии = ПроцентПремииСотрудника(Движение.Сотрудник, Движение.Период);
		
		Если ПроцентПремии <> Неопределено Тогда
			Движение.СуммаКОплате = Движение.ЧасовКОплате * Договор.ВКМ_СтоимостьЧаса * ПроцентПремии / 100; 
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Специалисту не установлен процент премии. проведение не возможно!");
			Отказ = Истина;
		КонецЕсли;
		
	Иначе 
				
		Если НЕ АбонентскийДоговор Тогда
			ОбщегоНазначения.СообщитьПользователю("Выбранный договор не является абонентским договором. Проведение невозможно",, "Объект.Договор");
		КонецЕсли;
		
		Если НЕ ДействующийДоговор Тогда
			ОбщегоНазначения.СообщитьПользователю("Дата документа выходит за период действия договора. Проведение невозможно");
		КонецЕсли;
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() Тогда
		Исполнитель = ЭтотОбъект.Специалист;
		ДатаРабот = ЭтотОбъект.ДатаПроведенияРабот;
		ВремяНачалаРабот = ЭтотОбъект.ВремяНачалаРаботПлан;
		
		ТекстСообщения = СтрШаблон("Создан новый документ обслуживание клиента. Исполнитель %1, дата исполнения %2, время начала работ %3",
		Исполнитель, ДатаРабот, ВремяНачалаРабот);
		
		ДобавитьВСправочникУведомленияТГБотТекстСообщения(ТекстСообщения);
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Представление КАК Документ,
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачала,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДокументОбслуживания = Выборка.Документ;
			ДатаРабот = Выборка.ДатаРабот;
			ВремяНачала = Выборка.ВремяНачала;
			Специалист1 = Выборка.Специалист;
		КонецЦикла;
		
		Если ДатаПроведенияРабот <> ДатаРабот Тогда
			ТекстСообщения = СтрШаблон("В документе обслуживания %1 изменена дата проведения работ. Новая дата %2",
			ДокументОбслуживания, Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"));
			ДобавитьВСправочникУведомленияТГБотТекстСообщения(ТекстСообщения);
		КонецЕсли;
		
		Если ВремяНачалаРаботПлан <> ВремяНачала Тогда
			ТекстСообщения = СтрШаблон("В документе обслуживания %1 изменено время начала работ. Новое время %2",
		    ДокументОбслуживания, Формат(ВремяНачалаРаботПлан, "ДЛФ=T"));
			ДобавитьВСправочникУведомленияТГБотТекстСообщения(ТекстСообщения);
		КонецЕсли;
		
		Если Специалист <> Специалист1 Тогда
			ТекстСообщения = СтрШаблон("В документе обслуживания %1 изменен исполнитель. Новый исполнитель %2",
			ДокументОбслуживания, Специалист);
			ДобавитьВСправочникУведомленияТГБотТекстСообщения(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроцентПремииСотрудника(Специалист, Дата)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудников.Период = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)
		|	И ВКМ_УсловияОплатыСотрудников.Сотрудник = &Специалист";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Специалист", Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Выборка.Следующий();
		Возврат Выборка.ПроцентОтРабот;
	КонецЕсли;

КонецФункции

Процедура ДобавитьВСправочникУведомленияТГБотТекстСообщения(ТекстСообщения)
	
	НовыйЭлемент = Справочники.ВКМ_УведомленияТГБот.СоздатьЭлемент();
	НовыйЭлемент.ТекстСообщения = ТекстСообщения;
	НовыйЭлемент.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
